---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFilter.Dispose
source: html/6830e4c4-13dc-5e85-5d0c-715de0a52bf1.htm
---
# Autodesk.Revit.DB.ScheduleFilter.Dispose Method

Releases all resources used by the ScheduleFilter

## Syntax (C#)
```csharp
public void Dispose()
```